task_comment_filter = [
    "вы назначены исполнителем.", "вы назначены соисполнителем.", "вы добавлены наблюдателем.",
    "Крайний срок изменен на:", "Задача почти просрочена.", "Завершите задачу или передвиньте срок.",
    "Необходимо указать крайний срок", "Задача возвращена в работу", "Задача завершена",
    "Проект задачи изменен на:",
    "[/USER] на [USER=",
    "] стал наблюдателем",
    "] добавил описание задачи",
    "] добавил наблюдателя(ей)",
    "] создал [",
    "] удалил наблюдателя(ей) [",
    "] удалил крайний срок задачи",
    "], задача просрочена [",
    "] завершил задачу"
    "Чтобы прочитать комментарии, которые ранее оставили участники задачи, нажмите на кнопку ниже",
    "Это новый чат задачи, в нём вы можете созваниваться с участниками, обмениваться файлами и обсуждать задачу",
]
